Revit 2027 API
BuiltInFailures.AutoRouteFailures.NoAutoRouteSolutionFoundError Property
 No auto-route solution was found.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoAutoRouteSolutionFoundError { get; }
Public Shared ReadOnly Property NoAutoRouteSolutionFoundError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoAutoRouteSolutionFoundError {
	FailureDefinitionId^ get ();
}
static member NoAutoRouteSolutionFoundError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace